print("---------------------------12月份衣服销售数据-----------------------------")
print("-----------------------------------------------------------------------")
print("日期       服装名称        价格/件      库存数量          销售量/每日")
print("1号        羽绒服         253.6        500               10")
print("2号        牛仔裤         86.3         600               60")
print("3号        风衣           96.8         335               43")
print("4号        皮草           135.9        855               63")
print("5号        T恤            65.8         632              63")
print("6号        衬衫           49.3         562              120")
print("7号        牛仔裤          86.3         600              72")
print("8号        羽绒服          253.6        500              69")
print("9号        牛仔裤          86.3         600              35")
print("10号       羽绒服          253.6        500             140")
print("11号       牛仔裤          86.3         600              90")
print("12号       皮草           135.9        855              24")
print("13号       T恤            65.8         632              45")
print("14号       风衣           96.8         335               25")
print("15号       牛仔裤          86.3         600              60")
print("16号       T恤            65.8         632             129")
print("17号       羽绒服          253.6        500              10")
print("18号        风衣           96.8         335             43")
print("19号       T恤            65.8         632              63")
print("20号       牛仔裤          86.3         600              60")
print("21号       皮草           135.9         855             63")
print("22号       风衣           96.8          335             60")
print("23号       T恤            65.8         632              58")
print("24号       牛仔裤          86.3         600             140")
print("25号       T恤            65.8         632              48")
print("26号       风衣           96.8          335             43")
print("27号       皮草           135.9         855             57")
print("28号       羽绒服         253.6         500             10")
print("29号       T恤           65.8          632             63")
print("30号       风衣           96.8          335             78")
print("------------------------------------------------------------------------")
print("总金额为：￥", format(469*65.8 + 120*49.3 + 292*96.8 + 517*86.3 + 207*135.9 + 239*253.6,'.2f'))
print("平均日销售量：",format(1844/30, '.1f'),"件/日")
print("羽绒服本月销售占比：",format((60610.4/126800*100),'.1f'),"%")
print("牛仔裤本月销售占比：",format((44617.1/51780*100),'.1f'),"%")
print("风衣本月销售占比：",format((28265.6/32428*100),'.1f'),"%")
print("皮草本月销售占比：",format((28131.3/116194.5*100),'.1f'),"%")
print("T恤本月销售占比：",format((30860.2/41585.6*100),'.1f'),"%")
print("衬衫本月销售占比：",format((5916/27706.6*100),'.1f'),"%")
print("------------------------------------------------------------------------")
print("------------------------------------------------------------------------")
print("------------------------------------------------------------------------")
print("------------------------------------------------------------------------")
print("------------------------------------------------------------------------")
print("变量")
id1="1号"
clothname1="羽绒服"
price1=253.6
quan1=500
num1=10

id2="2号"
clothname2="皮草"
price2=253.5
quan2=500
num2=10

id3="3号"
clothname3="衬衫"
price3=2333.5
quan3=504
num3=11
print("----------12月份衣服销售数据-------------------------")
print("--------------------------------------------------")
print("日期   服装名称    价格/件    库存数量   销售量/每日")
print("--------------------------------------------------")
print(id1,"     ",clothname1,"       ",price1,"       ",quan1,"     ",num1)
print(id2,"     ",clothname2,"       ",price2,"       ",quan2,"     ",num2)
print(id3,"     ",clothname3,"     ",price3,"     ",quan3,"      ",num3)
print("------------------------------------------------------------------------")
print("------------------------------------------------------------------------")
print("------------------------------------------------------------------------")
print("------------------------------------------------------------------------")
print("------------------------------------------------------------------------")
print("快捷输入")
# 衣服各种数据的显示
print("---------------------------------------------------------------------------")
print("\t日期\t\t\t服装名称\t\t\t价格/件\t\t\t库存数量\t\t\t销售量/每日\t\t\t")
#衣服的名称数组
clothing_names = (["羽绒服","牛仔裤","风衣","皮草","T血","衬衫","牛仔裤","羽绒服","牛仔裤","羽绒服",
                   "牛仔裤","皮草","T血","风衣","牛仔裤","T血","羽绒服","风衣","T血","牛仔裤","皮草",
                   "风衣","T血","牛仔裤","T血","风衣","皮草","羽绒服","T血","风衣"])
#衣服的单价
prices = ([253.6,86.3,96.8,135.9,65.8,49.3,86.3,253.6,86.3,253.6,86.3,135.9,65.8,96.8,86.3,65.8,
           253.6,96.8,65.8,86.3,135.9,96.8,65.8,86.3,65.8,96.8,135.9,253.6,65.8,96.8])
#库存数量
quantitys = ([500,600,335,855,632,562,600,500,600,500,600,855,632,335,600,632,
              500,335,632,600,855,335,632,600,632,335,855,500,632,335])
#销售量
saless = ([10,60,43,63,63,120,72,69,35,140,90,24,45,25,
           60,129,10,43,63,60,63,60,58,140,48,43,57,10,63,78])
#销量的记录表
day = 0
while day<30:
    days=day+1
    print("\t",days,"号\t\t",clothing_names[day],"\t\t\t",prices[day],"\t\t\t",quantitys[day],"\t\t\t",saless[day])
    day+=1
#总价
total = 0
day = 0
while day<30:
    i = prices[day]
    k = saless[day]
    total = total+i*k
    day+=1
totals = int(total*10)
total= totals/10
print("该月衣服销量",total,"元")

#平均销售量
average_sales = total/30
average = int(average_sales*10)
average_sales=average/10
print("该月平均每日销售量为",average_sales,"元")

#每日销售额占比  proportion
day = 0
while day<30:
    i = prices[day]
    k = saless[day]
    proportion = i*k/total
    propor = int(proportion*10000)
    propor = propor/100
    print("第",day+1,"日",clothing_names[day],"的销售额占当月的",propor,"%")
    day+=1