#有一个列表，[“北京”,”上海”,”广东”]
#1)将中国所有省会城市添加到上述列表中
#2)广东成为第二大发达城市，将广东排在上海前面
#3)[36710.36,35427.10,29863.23,29667.39,27665.36,27650.45,27620.38,25369.20]这是中国GDP排名前8的城市的GDP数值，请统计前8城市的GDP总和，平均GDP。

cities=["北京","上海","广东"]
print(cities)
print("------------------------------------------------------------------------------------")
cities.append("郑州,哈尔滨,长春,沈阳,呼和浩特,石家庄,乌鲁木齐,兰州,西宁,西安,银川,济南,太原,合肥,武汉,长沙,南京,成都,贵阳,昆明,南宁,拉萨,杭州,南昌,福州,台北,海口")
print(cities)
print("------------------------------------------------------------------------------------")
cities=["北京","广东","上海"]
print(cities)
print("-------------------------------------------------------------------------------------")
GDP=[36710.36,35427.10,29863.23,29667.39,27665.36,27650.45,27620.38,25369.20]
sum=0
i=0
while i<len(GDP):
    sum =sum+GDP[i]
    i=i+1
print("GDP总和:",sum)
ave=sum/8
print("平均GDP:",ave)